<template>
    <b-modal id="detail-modal-4" hide-footer size="xl" title="④ 大手Webサービス企業向けの社内PayPayポイント付与ツールシステムでのオークション系キャンペーン対応・メンテナンス作業">
        <p class="my-4">
【2020年03月～現在（2021年05月）】 <br>
■ 大手Webサービス企業向けの社内PayPayポイント付与ツールシステムでのオークション系キャンペーン対応・メンテナンス作業<br>
【担当フェーズなど】<br>
- 要件定義・設計・開発・テスト <br>
【業務詳細】<br>
①  オークション系キャンペーンの対応<br>
- 企画の方で作成されたキャンペーン仕様書を確認し、その条件に合う対象者を抽出するクエリを開発<br>
- ユーザーがオークションで「出品・入札・落札」などの操作を行うとそのログがHive環境のDBに残される<br>
- DBにある様々なログから、開催しているキャンペーンの条件に合う対象者・付与ポイント数を抽出するクエリを開発<br>
- 開発したクエリはHiveのディレクトリであるHDFS下に格納<br>
- フロントエンド側ではキャンペーン条件に合うパラメータをXMLで作成し、そのXMLを元にOozieを起動させてHiveから対象者・付与ポイント数を抽出<br>
- 抽出した対象者・付与ポイント数ファイルはPayPayGW(Amazon S3)内<br>
に投入し、投入後の連携完了まで確認を行う<br>
</p>
    </b-modal>
</template>
<script>
    export default {
        mounted() {
            console.log('NavVar mounted.')
        }
    }
</script>
